In [1]:
import pandas as pd #importing the library

In [2]:
arr=[23,34,34,56,76]
S1=pd.Series(arr) #defining array
S1

0    23
1    34
2    34
3    56
4    76
dtype: int64

In [3]:
arri=[23,45,46,78,98,12]
order=[1,2,3,4,5,6]
S2=pd.Series(arri,index=order) #indexing array
S2

1    23
2    45
3    46
4    78
5    98
6    12
dtype: int64

In [4]:
S2[:3] #printing the first three values

1    23
2    45
3    46
dtype: int64

In [5]:
S2[3:] #printing other values after three first values

4    78
5    98
6    12
dtype: int64

In [6]:
S3=S1.append(S2) #combining two arrays
S3

0    23
1    34
2    34
3    56
4    76
1    23
2    45
3    46
4    78
5    98
6    12
dtype: int64

In [7]:
S3.drop(3) #deleting values having index[3]

0    23
1    34
2    34
4    76
1    23
2    45
4    78
5    98
6    12
dtype: int64

In [8]:
S2.div(S1) #dividing S1 values with S2 values

0         NaN
1    0.676471
2    1.323529
3    0.821429
4    1.026316
5         NaN
6         NaN
dtype: float64

In [9]:
dates=pd.date_range('today',periods=6) #defining days starting from today
dates

DatetimeIndex(['2022-09-29 15:47:56.593536', '2022-09-30 15:47:56.593536',
               '2022-10-01 15:47:56.593536', '2022-10-02 15:47:56.593536',
               '2022-10-03 15:47:56.593536', '2022-10-04 15:47:56.593536'],
              dtype='datetime64[ns]', freq='D')

In [10]:
import numpy as np #importing numpy library
num_arr=np.random.randn(6,4) #definig the data and its shape
columns=['A','B','C','D'] #naming columns
df1=pd.DataFrame(num_arr,index=dates,columns=columns)
df1

                                   A         B         C         D
2022-09-29 15:47:56.593536  1.082719 -0.285322  0.056433  0.576262
2022-09-30 15:47:56.593536  1.124383 -0.105619 -1.597643 -0.780578
2022-10-01 15:47:56.593536 -0.639252 -1.996137  1.715468  1.727029
2022-10-02 15:47:56.593536 -0.630344  1.125271 -0.281800 -1.002593
2022-10-03 15:47:56.593536 -0.537627  0.608260 -0.228648 -1.273260
2022-10-04 15:47:56.593536  0.255471  0.285344  1.851223 -0.288552

In [11]:
data={'Fruits': ['Mango','Banana','Lemon','Ovacado'], 'Cost': [400,200,450,500],
             'Orders': [12,np.nan,15,18]} #definig arrays inside one array
df=pd.DataFrame(data)
df

    Fruits  Cost  Orders
0    Mango   400    12.0
1   Banana   200     NaN
2    Lemon   450    15.0
3  Ovacado   500    18.0

In [12]:
df.mean()#findin mean of the data

C:\Users\hp\AppData\Local\Temp/ipykernel_2940/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Cost      387.5
Orders     15.0
dtype: float64

In [25]:
df.T

            0       1      2        3
Fruits  Mango  Banana  Lemon  Ovacado
Cost      400     200    450      500
Orders   12.0     NaN   15.0     18.0

In [14]:
df.isnull() #checking any null values

   Fruits   Cost  Orders
0   False  False   False
1   False  False    True
2   False  False   False
3   False  False   False

In [15]:
df.iloc[1:3] #printing data starting index[1] to index[3]

   Fruits  Cost  Orders
1  Banana   200     NaN
2   Lemon   450    15.0

In [20]:
df.Cost.mean() #finding mean for cost

387.5

In [21]:
df.T

            0       1      2        3
Fruits  Mango  Banana  Lemon  Ovacado
Cost      400     200    450      500
Orders   12.0     NaN   15.0     18.0

In [24]:
df.Cost.mean()

387.5

In [37]:
df.fillna(20) #filling any null value with 20

    Fruits  Cost  Orders
0    Mango   400    12.0
1   Banana   200    20.0
2    Lemon   450    15.0
3  Ovacado   500    18.0

In [39]:
df[['Orders']].mean()

Orders    15.0
dtype: float64

In [43]:
df.to_csv('fruits.csv')

In [44]:
dataset=pd.read_csv('fruits.csv')
dataset.head(3)

   Unnamed: 0  Fruits  Cost  Orders
0           0   Mango   400    12.0
1           1  Banana   200     NaN
2           2   Lemon   450    15.0

In [45]:
df.to_excel('fruits.xlsx',sheet_name='Fruits') #converting dataset into excel format

In [48]:
dataset2=pd.read_excel('fruits.xlsx','Fruits') #reading values from excel
dataset2

   Unnamed: 0   Fruits  Cost  Orders
0           0    Mango   400    12.0
1           1   Banana   200     NaN
2           2    Lemon   450    15.0
3           3  Ovacado   500    18.0

In [50]:
dataset3=pd.read_excel('Dogs.xlsx')
dataset3

     Name  Age  value  weight
0     Rex   15   2000      20
1   Tommy   13   3000      32
2   Bingo   10   2500      24
3    Mick    7   3400      35
4    Runn   15   4600      23
5    Mick   23   5000      34
6    Mass   17   5600      36
7    mesh   15   4500      26
8  Killer   19   4000      25

In [51]:
dataset3[['Age']].mean()

Age    14.888889
dtype: float64

In [55]:
dataset3.describe()

             Age        value     weight
count   9.000000     9.000000   9.000000
mean   14.888889  3844.444444  28.333333
std     4.702245  1202.197063   5.937171
min     7.000000  2000.000000  20.000000
25%    13.000000  3000.000000  24.000000
50%    15.000000  4000.000000  26.000000
75%    17.000000  4600.000000  34.000000
max    23.000000  5600.000000  36.000000